app/controllers/posts_controller.rb

  def create
    # Post.create(params[:post])
    Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-07-18 19:21:45.308950"], ["updated_at", "2018-07-18 19:21:45.308950"]]